// var arr1 = new Array();
var arr1 = [
    '《徐明浩 那幕falling down》\n',
    '《徐明浩 小时候的梦想当明星》\n',
    '《徐明浩 作词作曲编舞》\n',
    '《徐明浩 蓝鸟热趋常驻者》\n',
    '《徐明浩 青春有你舞蹈导师》\n',
    '《徐明浩 出道六周年》\n',
    '《徐明浩 夜伴雨自作曲好听》\n',
    '《徐明浩可爱》\n',
    '《徐明浩温柔》\n',
    '《徐明浩舞蹈》\n',
    '《徐明浩舞台》\n',
    '《徐明浩青你》\n',
    '《徐明浩那幕》\n',
    '《徐明浩综艺》\n',
    '《徐明浩青春有你》\n',
    '《徐明浩时尚》\n',
    '《徐明浩有趣》\n',
    '《徐明浩bboy》\n',
    '《徐明浩小八老师》\n',
    '《徐明浩武术》\n',
    '《徐明浩行走的画报》\n'
];

var arr2 =[
    '谁的童话书又没合好，让公主跑出来了？',
    '月色和雪色之间，你是第三种绝色',
    '你是无意穿堂风，偏偏孤倨引山洪',
    '做个梦给你，等到看你银色满际，等到分不清季节更替，才敢说沉溺',
    '云飘散在时光里，花绽放在时光里，你眨眼，时光在你的眼里',
    '你是这世间一切美好事情的前提，你是人间这不毛之地的高楼林立，你是海风渐暖吹过月亮的欢喜，你是春风得意',
    '把眉清目秀还给山水天地，把松间细雨还给初遇，把一见钟情还给你',
    '星河耿耿，不如你眼眸璀璨，晚风习习，不如你温柔绮丽',
    '浮世三千，吾爱有三，日，月与卿，日为朝，月为暮，卿为朝朝暮暮',
    '见山是深情伟岸，见海是热情澎湃，见花见草信他们皆有故事，唯独见了你，山川沉默，海面静谧，花鸟鱼虫被光与尘凝固，世界万籁俱寂，只剩下你啊',
    '冬天的糖霜，秋天的麦芽糖，夏天的莲子羹，春天的绿豆酥，都甜不过你的笑',
    '世界兵荒马乱，唯有你，方能抵御这岁月漫长',
    '你眨一下眼，就翻阅了我心里的春夏秋冬',
    '突然明白这世间所有丹青水墨，山遥水阔，都是为了铺垫你这人间绝色',
    '你啊，大抵就是那陈年清酿，那七月急雨，是那词不达意的温柔，是我的心上人，天上月',
    '你的名字，是我见过最短的情诗',
    '你是字里行间的隐喻，藏在开头，躲在结尾，断句里有笑意，韵脚里有深情，句句无你，却句句是你',
    '你是远方的风景，我是游走的旅人，我翻山越岭长途跋涉，只为看你一眼',
    '我的心里原本荒芜寸草不生，后来你来这走了一遭，奇迹般万物生长',
    '你是日日夜夜的想念和永不落幕的深夜星辰',
    '你像是一场遥不可及的梦，却在我的世界里真实无比',
    '除了故乡，我只为你一人写过月亮',
    '这世上一切美好的事，你就占了99％',
    '晚风轻踩着云朵 月亮在贩售快乐 你从银河后靠近我 我与星辉一同为你沉沦',
    '不用见日月，你就是星辰',
    '不要淋到雨啦，不然你会可爱到发芽。',
    '上一次喜欢你，是在说这句话之前',
    '今天本该没有那么惊喜，但是你来了',
    '你猜我想吃什么? 痴痴地望着你',
    '甜有100种方式 吃糖 蛋糕和98次想你',
    '说星星好看的人一定没见过你的眼睛',
    '三十的晚上鞭炮再响 也没有我想你那么想',
    '神的爱情从希腊开始 我的爱情从你开始',
    '你去学游泳吧，这样我们就能永浴爱河了',
    '你是我的玫瑰你是我的花，小鸟的情话只给您夸',
    '你知道为什么我这么好动吗? 因为每一刻都在为你心动',
    '你知道天上的什么酒最好喝吗 天长地久',
    '你知道牛肉怎么吃才好吃吗? 我喂你吃',
    '你上辈子一定是碳酸饮料吧? 那为什么我一看到你就能开心的冒泡',
    '每次看到樱桃就会想到幸福 可是幸福是生生不息又难以触及的远',
    '可以给我一片泡腾片吗? 为什么每次看到你我就那么没有抵抗力',
    '我总在意流云与星群的坐标，一朵花开谢的时日，原野与平川一望无垠是否平展。哪知你轻轻抬起眉梢，竟赐予我一生大好河山。',
    '以为你在哪里 原来就住在我心里',
    '可以笑一个吗?我今天出门有点缺糖',
    '你知道你和星星有什么区别吗?星星在天上，你在我心里',
    '生活不是热血动漫，但你永远是我的主角。',
    '星尘是宇宙的披风，而你是宇宙中最美好的生命体',
    '你的眸中有山川河流 胜过我行经路上的一切不朽',
    '你是雾是旧梦，是写在糖纸上的诗，是我心上的一间小酒馆',
    '星河璀璨，阳光干净，在人间所有美好的存在里，我总是最爱你。',
    '喜欢一切可爱的人与事，悦耳的风铃、伸懒腰的猫咪、叽叽喳喳的小鸟、在风里翻飞的书页上的漂亮的文字。喜欢世间万物，但我更喜欢你，因为你是可爱本身。',
    '我不知道歌里唱的是谁，我听的全是你。',
    '我从来没遇见过如此温柔的人。他像春夏秋冬的流转，像人间错落的烟火，像东京初见的樱花，像爱伦披的诗歌。他称得上世间一切美好的形容词，而这样一来，一切绝美的景色，岂不都融成了他眼底的一片波光潋滟的清澈。',
    '你是我安稳岁月里的节外生枝。',
    '我以为我看够了阳光 ，它泛滥得多廉价而寻常 ，直到与你人海相望 ，才知我从未曾真的见过阳光。',
    '突然明白这世上所有丹青水墨，山遥水阔，都是为了铺垫你这人间绝色。',
    '你要是愿意，我就永远存在。',
    '你像夏至的分界线，是我一生里最长的那个白天',
    '此生能够遇上你，是上苍对我最大的赐福。我会好好珍惜这份缘。',
    '永远如初，不管有多么困难，不管你是否听见，都会一心向你，如最初般珍惜这份爱。',
    '时间不会重来，幸福不会永远，真情贵在天天，甜蜜留在心田，相爱的缘，永远不会消散，终点，只会更珍惜当前，把幸福膨胀，把真爱飞扬，愿一年的时光，给你十年的幸福。',
    '不管花开花落，有你就有美好的生活;且看云卷云舒，有你是我一生的幸福。细碎时光，悠长岁月，爱如参天树，开出甜蜜花。',
    '我想在五十年之后我一定还是像现在一样爱你。',
    '我不去想是否能够成功，既然选择了远方，便只顾风雨兼程;我不去想，身后会不会袭来寒风冷雨，既然目标是地平线，留给世界的只能是背影。',
    '你若流泪，先湿的是我的心。',
    '幸福很简单，就是我和你一直在一起。',
    '你是什么人 你是我的心上人',
    '我不想撞南墙了 只想撞你的胸膛',
    '我一点不想你 但一点半想你了',
    '我对你的爱，就像拖拉机上山轰轰烈烈',
    '你就委屈一下，栽在我手里行不行?',
    '你上辈子一定是碳酸饮料吧? 那为什么我一看到你就能开心的冒泡',
    '星河耿耿，不如你眼眸璀璨，晚风习习，不如你温柔绮丽',
    '你称得上一切美好 你就是美好本身',
    '早知道就给你糖了，你居然在我心里捣乱。',
    '弱水三千我只取一瓢，你就是那个瓢',
    '你有时候是不是特孤独?世界上这么优秀的人就只有你一个!',
    '你也太好看了吧！好想亲自在你身边感受你的魅力',
    '想给自己颁一个最佳进步奖，毕竟我每天都爱你比昨天多一点',
    '螃蟹在剥我的壳，笔记本在写我；漫天的我落在枫叶雪花上；而你在想我。',
    '上天太偏心了，你一个集中了万千优点',
    '春风再美也比不上你的笑，没见过你的人不会明了。',
    '我知道你也在向我靠近,星河万顷都是我的见面礼。',
    '松鼠用叶子埋住脚，小溪揉揉岩石的头，彩虹悄悄趴在云边，梅园落下一颗苹果，嘿，是我的心上人来了',
    '把细碎的烦恼暂停关掉，把月亮挂好，睡个好觉。晚安。',
    '想咬你一口 尝尝你到底是什么东西做的 居然这么可爱',
    '别对我使用美人计 否则我会将计就计🙈',
    '喜欢一切可爱的人与事，悦耳的风铃、伸懒腰的猫咪、叽叽喳喳的小鸟、在风里翻飞的书页上的漂亮的文字。喜欢世间万物，但我更喜欢你，因为你是可爱本身。',
    '你真是无敌螺旋丸究极爆炸炫酷狂拽五彩阿姆斯特朗回旋加速棒！',
    '如果你的一生需要有人捧在手上 那个人只能是我 必须是我',
    '如果以拥抱的姿势入睡 是不是就可以留住 梦中的你',
    '我在船头。失岸于朦胧的扁舟,由你在帆尾,挂了一弯半月。月先坠入水,晕不出涟漪。我才知道,这是你眼中的银河里,我们摘到的梦。',
    '你是我这一生只会遇见一次的惊喜。',
    '爱意若是十分满，我想予你十二分',
    '谁也不知道下一秒会发生什么，但是我能确信，在上一秒这一秒下一秒，我还是在喜欢你',
    '风带着秘密吹过一整片森林 于是每一棵树都知道 我只喜欢你',
    '今天除了喜欢你，我什么别的事也不做'


];

//仅随机生成
function newItem() {

    var item_num = 5;

    //获取单选框内的数字
    var select_num = document.getElementsByName("radio");
    for (i = 0; i < select_num.length; i++)
    {
        if(select_num[i].checked)
            item_num = select_num[i].value;
    }
    // console.log("单选框里的是" + item_num);

    var arr1_new = new Array(); //arr1_new存储词条数组
    var arr2_new = ""; //arr2_new存储彩虹屁字符串

    //第一部分，随机生成词条数组
    for(var k = 0; k < item_num; k++){
        var id = Math.ceil(Math.random()*(arr1.length) - 1);
        if(arr1_new.indexOf(arr1[id]) === -1){
            arr1_new.push(arr1[id]);
        }else{
            k= k - 1;
            continue;
        }
    }
    console.log(arr1_new);

    //第二部分，随机生成彩虹屁字符串
    var index = Math.ceil(Math.random()*(arr2.length) - 1);
    arr2_new = arr2[index];
    console.log(arr2_new);

    //输出生成的字符串，包括n个词条+1句彩虹屁
    var str_final = "";
    for(j = 0; j < arr1_new.length; j++)
        str_final += arr1_new[j];
    str_final += arr2_new;
    console.log(str_final);
    document.getElementById("new_item").innerHTML = str_final;

}

//仅复制
function copyItem() {
    var e = document.getElementById("new_item");
    e.select(); // 选择对象
    document.execCommand("Copy"); // 执行浏览器复制命令
    // alert("复制成功！");

}

//随机生成+复制
function newItemAndCopy() {
    var item_num = 5;

    //获取单选框内的数字
    var select_num = document.getElementsByName("radio");
    for (i = 0; i < select_num.length; i++)
    {
        if(select_num[i].checked)
            item_num = select_num[i].value;
    }
    // console.log("单选框里的是" + item_num);

    var arr1_new = new Array(); //arr1_new存储词条数组
    var arr2_new = ""; //arr2_new存储彩虹屁字符串

    //第一部分，随机生成词条数组
    for(var k = 0; k < item_num; k++){
        var id = Math.ceil(Math.random()*(arr1.length) - 1);
        if(arr1_new.indexOf(arr1[id]) === -1){
            arr1_new.push(arr1[id]);
        }else{
            k= k - 1;
            continue;
        }
    }
    console.log(arr1_new);

    //第二部分，随机生成彩虹屁字符串
    var index = Math.ceil(Math.random()*(arr2.length) - 1);
    arr2_new = arr2[index];
    console.log(arr2_new);

    //输出生成的字符串，包括n个词条+1句彩虹屁
    var str_final = "";
    for(j = 0; j < arr1_new.length; j++)
        str_final += arr1_new[j];
    str_final += arr2_new;
    console.log(str_final);
    document.getElementById("new_item").innerHTML = str_final;

    var e = document.getElementById("new_item");
    e.select(); // 选择对象
    document.execCommand("Copy"); // 执行浏览器复制命令
}
